"""Исключения для недопустимых ходов на игровом поле."""


class FieldIndexError(IndexError):
    """Выбрасывается, если выбрано значение вне поля."""

    def __init__(self, message="Введено значение за границами игрового поля!"):
        """Создать исключение с сообщением о выходе за границы поля."""
        super().__init__(message)


class CellOccupiedError(Exception):
    """Исключение при попытке изменить занятую ячейку."""

    def __init__(self, message="Попытка изменить занятую ячейку"):
        """Создать исключение с сообщением о занятой ячейке."""
        super().__init__(message)
